#pragma once

//--------------------------------------------------------------------------------------------------------------------------------
// версия ПО
//--------------------------------------------------------------------------------------------------------------------------------
#define SOFTWARE_VERSION "SoftRF_23_SkyWatch_17_01"  

#define DATA_MEASURE_THRESHOLD                      500    // через сколько миллисекунд обновлять показания

//--------------------------------------------------------------------------------------------------------------------------------
// Настройки текста
//--------------------------------------------------------------------------------------------------------------------------------
//#define WM_BACK_CAPTION "< НАЗАД"
//#define WM_SAVE_CAPTION "СОХРАНИТЬ"
//#define WM_MENU_CAPTION "М Е Н Ю"
//#define START_CAPTION   "ПУСК"
//#define MENU_CAPTION    "СЕРВИСНОЕ МЕНЮ"
//#define REPEAT_CAPTION  "ПОВТОР"
//#define CLEAR_CAPTION   "СБРОС"
//
//#define CAL_TIME_LCD_OFF "ОТКЛЮЧЕНИЕ LCD"
//#define CAL_TIME_POWER_OFF "OTKЛ. ПРИБОРА"
//#define STOP_CAPTION "СТОП"
//#define CAL_CAPTION "КАЛИБРОВКА"
//#define TIME_CAPTION "ВРЕМЯ РАБОТЫ"
//
//#define ENTER_CAPTION "ВВОД"
//
//#define SET_FREE "СВОБОДЕН"
//#define SET_CONTROLLER_ID "CONTROLLER ID"

//--------------------------------------------------------------------------------------------------------------------------------
// Настройки отображения спрайтов
//--------------------------------------------------------------------------------------------------------------------------------


#define gray 0x39C7
#define background1 0x29CC
#define background2 0x1928
#define left_button   36 //left button
#define right_button  39 //right button

#define distance_button   38 //left button

//--------------------------------------------------------------------------------------------------------------------------------
// экраны
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_TFT_MODULE // закомментировать, если не нужна поддержка TFT


//--------------------------------------------------------------------------------------------------------------------------------
// настройки TFT (используется экран с разрешением 320x240)
//--------------------------------------------------------------------------------------------------------------------------------
// цвета для TFT
// цвета для кнопок: цвет текста, не выяснил ,цвет рамки не нажат, цвет рамки при нажатии ,цвет заполнения
//--------------------------------------------------------------------------------------------------------------------------------
#define TFT_BACK_COLOR TFT_BLACK                // цвет фона
#define TFT_BUTTON_COLORS TFT_WHITE, 0x8410, WHITE, 0xF800, 0x001F
#define TFT_BUTTON_COLORS_BLUE TFT_WHITE, TFT_GREEN, TFT_WHITE, TFT_RED, TFT_BLUE

#define TFT_FONT_COLOR 0x4A69                   // цвет шрифта по умолчанию
#define TFT_CHANNELS_BUTTON_COLORS 0x3A8D, 0xC618, 0x8410, 0xF800, 0xEF7D // цвета кнопок для каналов
#define INFO_BOX_BACK_COLOR 0x6161              // цвет фона для информационного бокса
#define INFO_BOX_BORDER_COLOR TFT_BLACK         // цвет рамки информационного бокса
#define INFO_BOX_CAPTION_COLOR 0x33D6           // цвет заголовка информационного бокса
#define SENSOR_BOX_FONT_COLOR TFT_WHITE         // цвет показаний датчика
#define SENSOR_BOX_UNIT_COLOR TFT_WHITE         // цвет единиц изменений датчика
#define MODE_ON_COLOR 0x0400                    // цвет "вкл", "авто"
#define MODE_OFF_COLOR 0x8000                   // цвет "выкл", "ручной"
#define CHANNELS_BUTTONS_TEXT_COLOR TFT_WHITE   // цвет текста кнопок каналов
#define CHANNELS_BUTTONS_BG_COLOR 0xEF7D        // цвет фона кнопок каналов
#define CHANNEL_BUTTONS_TEXT_COLOR 0x3A8D       // цвет текста кнопки одного канала
#define TIME_PART_FONT_COLOR 0x0410             // цвет текста кнопки установки компонента времени
#define TIME_PART_SELECTED_FONT_COLOR TFT_WHITE // цвет текста активной кнопки компонента времени
#define TIME_PART_BG_COLOR 0xEF7D               // цвет фона кнопки компонента времени
#define TIME_PART_SELECTED_BG_COLOR 0x0400      // цвет фона выбранной кнопки компонента времени
#define STATUS_ON_COLOR 0x07E0                  // цвет статусов на экране ожидания
//--------------------------------------------------------------------------------------------------------------------------------

//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#ifdef _DEBUG
#define DBG(s) { Serial.print((s)); }
#define DBGLN(s) { Serial.print((s)); Serial.println(); }
#else
#define DBG(s) (void) 0
#define DBGLN(s) (void) 0
#endif
#define ENDL '\n'
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//template <typename T> inline Stream& operator << (Stream& s, T n) { s.print(n); return s; }
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------


//--------------------------------------------------------------------------------------------------------------------------------
