#pragma once

//--------------------------------------------------------------------------------------------------------------------------------
// версия ПО
//--------------------------------------------------------------------------------------------------------------------------------
#define SOFTWARE_VERSION "ver.2023.10.03_04"  

//--------------------------------------------------------------------------------------------------------------------------------
// настройки Serial. Настройки для общения через UART
//--------------------------------------------------------------------------------------------------------------------------------
#define SerialDEBUG                  Serial    // какой Serial использовать для работы с программой UROVConfig.exe
#define Serial_SPEED                 115200    // скорость работы с Serial
#define BUFFER_SIZE                     128    // Размер буфера входящих сообщений
//--------------------------------------------------------------------------------------------------------------------------------
#define _DEBUG // закомментировать для выключения отладочной информации
//--------------------------------------------------------------------------------------------------------------------------------
#define DATA_MEASURE_THRESHOLD                      1000    // через сколько миллисекунд обновлять показания с линий вольтажа (и часов)
#define VOLTAGE_THRESHOLD                             15    // порог изменений, в процентах, для принятия решения о том, хороший вольтаж или нет
//--------------------------------------------------------------------------------------------------------------------------------
//#define _WIFI_COMMANDS_OFF                                 // Поключить WiFi и WEB интерфейс
//--------------------------------------------------------------------------------------------------------------------------------
#define  _COM_COMMANDS_OFF                                 // Подключить прием команд по КОМ порту
//--------------------------------------------------------------------------------------------------------------------------------

//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// Настройка контроль аккумуляторов питания Показания умножить на 2
//--------------------------------------------------------------------------------------------------------------------------------
//#define POWER_BATTERY      35        // аналоговый вход контроля заряда аккумулятора питания. 
//#define BATTERY_CHARGE     34        // выход индикации контроллера заряда аккумулятора питания. 
//#define SUPPLY12_CONNECTED 33        // GPIO33 вход контроля подключения внешнего источника 12 в для заряда аккумулятора питания. 
//#define SUPPLY12_ON   "Зарядка"      // 
//#define PULSE_PERIOD      300        // период формирования импульса заряда миллисекунд 
//#define PULSE_DURATION    200        // длительность импульса заряда миллисекунд 


//--------------------------------------------------------------------------------------------------------------------------------
// Настройки включения питания одной кнопкой
//--------------------------------------------------------------------------------------------------------------------------------

//#define POWER_ON_IN  32              // вход контроля подачи питания. 
//#define POWER_ON_OUT 27              // Выход управления включения питания. 
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// время в миллисекундах, после которого идёт переключение на главный экран, если какой-то экран висит долгое время
#define RESET_TO_MAIN_SCREEN_DELAY 90000
// через какое время, в миллисекундах, гасить подсветку дисплея при питании от батарей
#define BACKLIGHT_OFF_DELAY          180  // секунд (3 минуты)
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#define TURN_POWER_OFF_DELAY        5000  // задержка выключения контроллера по нажатию кнопки выключения питания, миллисекунд
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#define TIME_POWER_OFF_DELAY         300  // задержка выключения питания 5 мин от аккумулятора, секунд
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#define CORRECT_DATA                  50  // признак корректного содержания данных                 



//--------------------------------------------------------------------------------------------------------------------------------
// настройки EEPROM 
//--------------------------------------------------------------------------------------------------------------------------------

//#define EEPROM_SIZE 200

//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// адреса хранения в EEPROM
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#define ControllerID_ADDRESS           10 // адрес хранения 
#define TimeLedLCD_ADDRESS             16 // адрес хранения 
#define TimePowerOff_ADDRESS           20 // адрес хранения  
#define TftCalibrationData_ADDRESS     30 // адрес хранения  

#define WIFI_STATE_EEPROM_ADDR         40 // адрес хранения состояния Wi-Fi (коннектится к роутеру или нет), 1 байт
#define STATION_PASSWORD_EEPROM_ADDR   44 // адрес хранения пароля к точке ESP, 20 байт
#define STATION_ID_EEPROM_ADDR         64 // адрес хранения ID точки доступа ESP, 20 байт
#define ROUTER_PASSWORD_EEPROM_ADDR    84 // адрес хранения пароля к роутеру, 20 байт
#define ROUTER_ID_EEPROM_ADDR         104 // адрес хранение ID роутера, 20 байт


//--------------------------------------------------------------------------------------------------------------------------------
// Настройки значений по умолчанию
//--------------------------------------------------------------------------------------------------------------------------------
//#define DEFAULT_CALIBRATION_TIME     60 // значение по умолчанию для времени калибровки
//#define DEFAULT_MEASURE_TIME         30 // значение по умолчанию для времени измерения
//#define MAX_PASSWORD_LENGTH           8 // максимальная длина вводимого пароля для доступа в сервисное меню
//#define MENU_PASSWORD             "123" // пароль для доступа в сервисное меню по умолчанию
//#define MASTER_PASSWORD         "14754" // мастер пароль для доступа во все меню
//#define MAX_TIME_VALUE              300 // сколько секунд максимум для настроек времени измерений и калибровки
//#define MAX_ATMOSFERA_LENGTH          4 // максимальная длина вводимого сигнала в воздухе согласно данных паспорта на датчик
//#define ATMOSFERA_DEFAULT         "450" // Уровень сигнала мв в атмосфере по умолчанию
//#define DEFAULT_ATMOSFERA_MS         10 // Уровень сигнала мв в 
#define MAX_TIME_LCD_LENGTH           4 // максимальная длина вводимого времени отключения подсветки дисплея
#define MAX_TIME_POWER_LENGTH         4 // максимальная длина вводимого времени отключения прибора
#define DEFAULT_ControllerID          1 // 
//#define DEFAULT_Reference_voltage   440 // Уровень опорного напряжения мв
#define MAX_WIFI_LENGTH              20 // максимальная длина вводимого пароля для доступа в WiFi

//--------------------------------------------------------------------------------------------------------------------------------
// Настройки текста
//--------------------------------------------------------------------------------------------------------------------------------
#define WM_BACK_CAPTION "< НАЗАД"
#define WM_SAVE_CAPTION "СОХРАНИТЬ"
#define WM_MENU_CAPTION "М Е Н Ю"
#define START_CAPTION   "ПУСК"
#define MENU_CAPTION    "СЕРВИСНОЕ МЕНЮ"
#define REPEAT_CAPTION  "ПОВТОР"
#define CLEAR_CAPTION   "СБРОС"

#define CAL_TIME_LCD_OFF "ОТКЛЮЧЕНИЕ LCD"
#define CAL_TIME_POWER_OFF "OTKЛ. ПРИБОРА"
#define STOP_CAPTION "СТОП"
#define CAL_CAPTION "КАЛИБРОВКА"
#define TIME_CAPTION "ВРЕМЯ РАБОТЫ"

#define ENTER_CAPTION "ВВОД"

#define SET_FREE "СВОБОДЕН"
#define SET_CONTROLLER_ID "CONTROLLER ID"

//--------------------------------------------------------------------------------------------------------------------------------
// Настройки отображения спрайтов
//--------------------------------------------------------------------------------------------------------------------------------


#define gray 0x39C7
#define background1 0x29CC
#define background2 0x1928
#define left_button   36 //left button
#define right_button  39 //right button



//--------------------------------------------------------------------------------------------------------------------------------
// экраны
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_TFT_MODULE // закомментировать, если не нужна поддержка TFT


//--------------------------------------------------------------------------------------------------------------------------------
// настройки TFT (используется экран с разрешением 320x240)
//--------------------------------------------------------------------------------------------------------------------------------
// цвета для TFT
// цвета для кнопок: цвет текста, не выяснил ,цвет рамки не нажат, цвет рамки при нажатии ,цвет заполнения
//--------------------------------------------------------------------------------------------------------------------------------
#define TFT_BACK_COLOR TFT_BLACK                // цвет фона
#define TFT_BUTTON_COLORS TFT_WHITE, 0x8410, WHITE, 0xF800, 0x001F
#define TFT_BUTTON_COLORS_BLUE TFT_WHITE, TFT_GREEN, TFT_WHITE, TFT_RED, TFT_BLUE

#define TFT_FONT_COLOR 0x4A69                   // цвет шрифта по умолчанию
#define TFT_CHANNELS_BUTTON_COLORS 0x3A8D, 0xC618, 0x8410, 0xF800, 0xEF7D // цвета кнопок для каналов
#define INFO_BOX_BACK_COLOR 0x6161              // цвет фона для информационного бокса
#define INFO_BOX_BORDER_COLOR TFT_BLACK         // цвет рамки информационного бокса
#define INFO_BOX_CAPTION_COLOR 0x33D6           // цвет заголовка информационного бокса
#define SENSOR_BOX_FONT_COLOR TFT_WHITE         // цвет показаний датчика
#define SENSOR_BOX_UNIT_COLOR TFT_WHITE         // цвет единиц изменений датчика
#define MODE_ON_COLOR 0x0400                    // цвет "вкл", "авто"
#define MODE_OFF_COLOR 0x8000                   // цвет "выкл", "ручной"
#define CHANNELS_BUTTONS_TEXT_COLOR TFT_WHITE   // цвет текста кнопок каналов
#define CHANNELS_BUTTONS_BG_COLOR 0xEF7D        // цвет фона кнопок каналов
#define CHANNEL_BUTTONS_TEXT_COLOR 0x3A8D       // цвет текста кнопки одного канала
#define TIME_PART_FONT_COLOR 0x0410             // цвет текста кнопки установки компонента времени
#define TIME_PART_SELECTED_FONT_COLOR TFT_WHITE // цвет текста активной кнопки компонента времени
#define TIME_PART_BG_COLOR 0xEF7D               // цвет фона кнопки компонента времени
#define TIME_PART_SELECTED_BG_COLOR 0x0400      // цвет фона выбранной кнопки компонента времени
#define STATUS_ON_COLOR 0x07E0                  // цвет статусов на экране ожидания
//--------------------------------------------------------------------------------------------------------------------------------

//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#ifdef _DEBUG
#define DBG(s) { Serial.print((s)); }
#define DBGLN(s) { Serial.print((s)); Serial.println(); }
#else
#define DBG(s) (void) 0
#define DBGLN(s) (void) 0
#endif
#define ENDL '\n'
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//template <typename T> inline Stream& operator << (Stream& s, T n) { s.print(n); return s; }
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#define CORE_COMMAND_GET F("GET=")             // префикс для команды получения данных из модуля LCD
#define CORE_COMMAND_SET F("SET=")             // префикс для команды сохранения данных в модуль LCD
#define CORE_COMMAND_ANSWER_OK F("OK ")       // какой префикс будет посылаться в ответ на команду получения данных и её успешной отработке
#define CORE_COMMAND_ANSWER_ERROR F("ERR ")   // какой префикс будет посылаться в ответ на команду получения данных и её неуспешной отработке
#define CORE_COMMAND_PARAM_DELIMITER '#'      // разделитель параметров
#define CORE_END_OF_DATA F("[END]")
#define CORE_COMMAND_DONE F("DONE")

//------------------------------------------------------------------------------------------------------------------------------------------------------------------------

#define LILYGO_TBeam_V1_X                // Модель модуля

#define LoRa_frequency      868.8E5      // Частота России
#define LoRa_test                        // Только для тестирования модуля LoRa
#define UNUSE_PIN                   (0)  // pin не назначен

#if defined(LILYGO_TBeam_V1_X)

#define GPS_RX_PIN                  34
#define GPS_TX_PIN                  12
#define BUTTON_PIN                  38
#define BUTTON_PIN_MASK             GPIO_SEL_38
#define I2C_SDA                     21
#define I2C_SCL                     22

#define HAS_PMU                         // Подключение контроллера питания
#define XPOWERS_CHIP_AXP2101
#define PMU_IRQ                     35  // Прерывание с контроллера питания AXP2101



#define RADIO_SCLK_PIN               5
#define RADIO_MISO_PIN              19
#define RADIO_MOSI_PIN              27
#define RADIO_CS_PIN                18
#define RADIO_DIO0_PIN              26
#define RADIO_RST_PIN               23
//#define RADIO_DIO1_PIN              33
//#define RADIO_BUSY_PIN              32

#define BOARD_LED                   4
#define LED_ON                      LOW
#define LED_OFF                     HIGH

#define GPS_BAUD_RATE               9600
#define HAS_GPS
#define GPS_TIME_PULSE              37  // Импульсы с модуля GPS

#define HAS_DISPLAY                     //Optional, bring your own board, no OLED !!
#define LCD_Led                     13  // Управление подсветкой дисплея
#define TFT_CS                      14  // Chip select control pin
#define LCD_Reset                   15  // Управление подсветкой дисплея
#define TFT_DC                       2  // Data Command control pin



#else
#error "For the first use, please define the board version and model in <utilities. h>"
#endif

//--------------------------------------------------------------------------------------------------------------------------------
