#pragma once


#define BUFFER_SIZE                     128    // Размер буфера входящих сообщений

#define DATA_MEASURE_THRESHOLD          500    // через сколько миллисекунд обновлять показания

//--------------------------------------------------------------------------------------------------------------------------------
// Настройки отображения спрайтов
//--------------------------------------------------------------------------------------------------------------------------------


//========================================================================================================
#define Response_message_block_ADDRESS   200    // начальный адрес хранения блока ответных сообщений

#define Start_Block_Text_ADDRESS        1000    // начальный адрес хранения блока текстовых сообщений
#define Max_Count_Block_Message           20    // Максимальное количество блоков записей сообщений
#define Number_of_bytes_block            100    // кличество байт одного блока текстовых сообщений
#define Number_of_bytes_time              11    // кличество байт блока времени текстовых сообщений

/*Сохраним в памяти переданные подтверждения о прочтении*/
#define Start_confirmation_ADDRESS     10000    // начальный адрес хранения блока переданных подтверждений прочтения текстовых сообщений
#define Number_of_bytes_confirmation      40    // кличество байт одного блока переданных подтверждений прочтения текстовых сообщений

#define MY_ACCESSPOINT_SSID ""
#define MY_ACCESSPOINT_PSK  ""

#define SOFTRF_IDENT            "FlyRF"
#define SOFTRF_FIRMWARE_VERSION "1.3"
#define FLYRF_FIRMWARE_VERSION "FlyRf_24_04_26.01"

#define RELAY_DST_PORT  12390
#define RELAY_SRC_PORT  (RELAY_DST_PORT - 1)

#define NMEA_UDP_PORT     10110
#define NMEA_TCP_PORT     2000

#define MAX_PKT_SIZE  32 /* 48 = UAT LONG_FRAME_DATA_BYTES */

//--------------------------------------------------------------------------------------------------------------------------------
// экраны
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_TFT_MODULE // закомментировать, если не нужна поддержка TFT

//--------------------------------------------------------------------------------------------------------------------------------
// настройки TFT (используется экран с разрешением 320x240)
//--------------------------------------------------------------------------------------------------------------------------------
// цвета для TFT
// цвета для кнопок: цвет текста, не выяснил ,цвет рамки не нажат, цвет рамки при нажатии ,цвет заполнения
//--------------------------------------------------------------------------------------------------------------------------------
#define TFT_BACK_COLOR TFT_BLACK                // цвет фона
#define TFT_BUTTON_COLORS TFT_WHITE, 0x8410, WHITE, 0xF800, 0x001F
#define TFT_BUTTON_COLORS_BLUE TFT_WHITE, TFT_GREEN, TFT_WHITE, TFT_RED, TFT_BLUE

#define TFT_FONT_COLOR 0x4A69                   // цвет шрифта по умолчанию
#define TFT_CHANNELS_BUTTON_COLORS 0x3A8D, 0xC618, 0x8410, 0xF800, 0xEF7D // цвета кнопок для каналов
#define INFO_BOX_BACK_COLOR 0x6161              // цвет фона для информационного бокса
#define INFO_BOX_BORDER_COLOR TFT_BLACK         // цвет рамки информационного бокса
#define INFO_BOX_CAPTION_COLOR 0x33D6           // цвет заголовка информационного бокса
#define SENSOR_BOX_FONT_COLOR TFT_WHITE         // цвет показаний датчика
#define SENSOR_BOX_UNIT_COLOR TFT_WHITE         // цвет единиц изменений датчика
#define MODE_ON_COLOR 0x0400                    // цвет "вкл", "авто"
#define MODE_OFF_COLOR 0x8000                   // цвет "выкл", "ручной"
#define CHANNELS_BUTTONS_TEXT_COLOR TFT_WHITE   // цвет текста кнопок каналов
#define CHANNELS_BUTTONS_BG_COLOR 0xEF7D        // цвет фона кнопок каналов
#define CHANNEL_BUTTONS_TEXT_COLOR 0x3A8D       // цвет текста кнопки одного канала
#define TIME_PART_FONT_COLOR 0x0410             // цвет текста кнопки установки компонента времени
#define TIME_PART_SELECTED_FONT_COLOR TFT_WHITE // цвет текста активной кнопки компонента времени
#define TIME_PART_BG_COLOR 0xEF7D               // цвет фона кнопки компонента времени
#define TIME_PART_SELECTED_BG_COLOR 0x0400      // цвет фона выбранной кнопки компонента времени
#define STATUS_ON_COLOR 0x07E0                  // цвет статусов на экране ожидания
//--------------------------------------------------------------------------------------------------------------------------------

//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#ifdef _DEBUG
#define DBG(s) { Serial.print((s)); }
#define DBGLN(s) { Serial.print((s)); Serial.println(); }
#else
#define DBG(s) (void) 0
#define DBGLN(s) (void) 0
#endif
#define ENDL '\n'
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//template <typename T> inline Stream& operator << (Stream& s, T n) { s.print(n); return s; }
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------


//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#define CORE_COMMAND_GET F("GET")             // префикс для команды получения данных из модуля LCD
#define CORE_COMMAND_SET F("SET")             // префикс для команды сохранения данных в модуль LCD
#define CORE_COMMAND_ANSWER_OK F("OK ")       // какой префикс будет посылаться в ответ на команду получения данных и её успешной отработке
#define CORE_COMMAND_ANSWER_ERROR F("ERR ")   // какой префикс будет посылаться в ответ на команду получения данных и её неуспешной отработке
#define CORE_COMMAND_PARAM_DELIMITER '|'      // разделитель параметров
#define CORE_COMMAND_PARAM_DELIMITERTXT '#'   // разделитель параметров
#define CORE_END_OF_DATA F("[END]")
#define CORE_COMMAND_DONE F("DONE")
#define CORE_TEXT_LCD F("#")                  // префикс для команды ввода текста. Пример #1#XXXXX Где "1" номер сообщения. ХХХХХ текст сообщения 
#define BUFFER_REQUEST_ER "$ER"               // префикс для команды запроса пустого буфера трекера
#define BUFFER_REQUEST_OK "$OK"               // префикс для команды запроса пустого буфера трекера

//------------------------------------------------------------------------------------------------------------------------------------------------------------------------


//--------------------------------------------------------------------------------------------------------------------------------
